/*
 * ***************************************************************************************** 		
 * 文件名称：PANGO_M1_ddr3.c
 * 功能描述：DDR3固件库函数
 ******************************************************************************************
 */

#include "PANGO_M1_ddr3.h"

/********************************************************************
** 函数名称：DDR_Init
** 函数功能：DDR3读、写突发长度初始化
** 输入参数：DDR_InitTypeDef：DDR3寄存器结构体指针
** 输出参数：无
** 返回参数：无
********************************************************************/
void DDR_Init(DDR_InitTypeDef* DDR_InitStruct)
{
	uint32_t ctrl_data = 0;
	ctrl_data = DDR_InitStruct->Write_Outburst_Len | (DDR_InitStruct->Read_Outburst_Len << 8);
	DDR->CTRL = ctrl_data;
}

/********************************************************************
** 函数名称：DDR_Set_Read_Addr
** 函数功能：设置DDR3读数据起始地址
** 输入参数：address：DDR3读数据起始地址
** 输出参数：无
** 返回参数：无
********************************************************************/
void DDR_Set_Read_Addr(uint32_t address)
{
	DDR->READ_ADDR = address;
}

/********************************************************************
** 函数名称：DDR_GetInitDoneStatus
** 函数功能：读取DDR3初始化状态，判断是否初始化完成
** 输入参数：无
** 输出参数：无
** 返回参数：DDR3初始化状态
********************************************************************/
FlagStatus DDR_GetInitDoneStatus(void)
{
	return (FlagStatus)((DDR->STATUS & DDR_STATUS_DONE) == DDR_STATUS_DONE);
}

/********************************************************************
** 函数名称：DDR_GetWriteStatus
** 函数功能：读取DDR3写数据状态，判断写数据是否完成
** 输入参数：无
** 输出参数：无
** 返回参数：DDR3写数据状态
********************************************************************/
FlagStatus DDR_GetWriteStatus(void)
{
	return (FlagStatus)((DDR->STATUS & DDR_STATUS_WRITE) == DDR_STATUS_WRITE);
}

/********************************************************************
** 函数名称：DDR_GetReadStatus
** 函数功能：读取DDR3读数据状态，判断读数据是否完成
** 输入参数：无
** 输出参数：无
** 返回参数：DDR3读数据状态
********************************************************************/
FlagStatus DDR_GetReadStatus(void)
{
	return (FlagStatus)((DDR->STATUS & DDR_STATUS_READ) == DDR_STATUS_READ);
}

/********************************************************************
** 函数名称：DDR_Write_Command
** 函数功能：DDR3写命令操作
** 输入参数：无
** 输出参数：无
** 返回参数：无
********************************************************************/
void DDR_Write_Command(void)
{
	while(DDR_GetWriteStatus() == 1);
	DDR->CMD = DDR_WRITE_CMD;
}

/********************************************************************
** 函数名称：DDR_Read_Command
** 函数功能：DDR3读命令操作
** 输入参数：无
** 输出参数：无
** 返回参数：无
********************************************************************/
void DDR_Read_Command(void)
{
	while(DDR_GetReadStatus() == 1);
	DDR->CMD = DDR_READ_CMD;
}

