/*
 * *****************************************************************************************		
 * 文件名称：PANGO_M1_wdog.c
 * 功能描述：WATCH DOG固件库函数
 ******************************************************************************************
 */

#include "PANGO_M1_wdog.h"

/********************************************************************
** 函数名称：WDOG_Init
** 函数功能：看门狗寄存器初始化，配置中断使能、看门狗模式等
** 输入参数：WDOG_InitTypeDef：WATCH DOG寄存器结构体指针
** 输出参数：无
** 返回参数：无
********************************************************************/
ErrorStatus WDOG_Init(WDOG_InitTypeDef* WDOG_InitStruct)
{
	WDOG->LOAD = 0;
	WDOG->CTRL = 0;
	WDOG->INTCLR = 0;
	WDOG->LOCK = 0;
	WDOG->ITCR = 0;
	WDOG->ITOP = 0;

	if(WDOG_InitStruct->WDOG_Lock == DISABLE)									/* 判断是否禁止看门狗锁寄存器 */
	{
		WDOG->LOCK = 0xFFFFFFFF; 												/* 锁 : bit[0]为1，禁止写入口寄存器 */
		return ERROR;	
	}  
	WDOG->LOCK = 0xACCE551 << WDOG_LOCK_EN_Pos;  								/* 不加锁：bit[0]为0，使能写通道全部寄存器 */

	if(WDOG_InitStruct->WDOG_Res == ENABLE)										/* 判断是否使能控制寄存器的复位bit */
	{
		WDOG->CTRL |= WDOG_CTRL_RESEN;

		if(WDOG_InitStruct->WDOG_ITMode == ENABLE)								/* 判断是否配置一体化测试模式寄存器 */
		{
			WDOG->ITCR |= WDOG_ITCR_INTEGTESTEN;
			WDOG->ITOP |= WDOG_ITOP_WDOGRES;									/* 设置ITOP寄存器WDOGRES位 */
		}
	}

	if(WDOG_InitStruct->WDOG_Int == ENABLE)										/* 判断是否使能控制寄存器中断位*/
	{
		WDOG->CTRL |= WDOG_CTRL_INTEN;
		{																		/* 配置一体化测试模式寄存器 */
			WDOG->ITCR |= WDOG_ITCR_INTEGTESTEN;
			WDOG->ITOP |= WDOG_ITOP_WDOGINT;									/* 设置ITOP寄存器WDOGRES位 */
		}
	}
	WDOG->LOAD = WDOG_InitStruct->WDOG_Reload;									/* 设置看没够计数器重新加载值 */  
	return SUCCESS;
}

/********************************************************************
** 函数名称：WDOG_RestartCounter
** 函数功能：重启看门狗计数器，重新加载计数值
** 输入参数：reload：重新加载计数值
** 输出参数：无
** 返回参数：无
********************************************************************/
void WDOG_RestartCounter(uint32_t reload)
{
	WDOG->LOAD = reload;
}

/********************************************************************
** 函数名称：WDOG_GetCounterValue
** 函数功能：获取当前看门狗计数器的值
** 输入参数：无
** 输出参数：无
** 返回参数：当前看门狗计数值
********************************************************************/
uint32_t WDOG_GetCounterValue(void)
{
	return WDOG->VALUE;
}

/********************************************************************
** 函数名称：WDOG_SetResetEnable
** 函数功能：设置使能看门狗复位功能
** 输入参数：无
** 输出参数：无
** 返回参数：无
********************************************************************/
void WDOG_SetResetEnable(void)
{
	WDOG->CTRL |= WDOG_CTRL_RESEN;
}

/********************************************************************
** 函数名称：WDOG_GetResStatus
** 函数功能：获取当前看门狗复位状态
** 输入参数：无
** 输出参数：无
** 返回参数：当前看门狗复位状态
********************************************************************/
FlagStatus WDOG_GetResStatus(void)
{
	return (FlagStatus)(WDOG->CTRL==WDOG_CTRL_RESEN);
}

/********************************************************************
** 函数名称：WDOG_SetIntEnable
** 函数功能：设置使能看门狗中断
** 输入参数：无
** 输出参数：无
** 返回参数：无
********************************************************************/
void WDOG_SetIntEnable(void)
{
	WDOG->CTRL |= WDOG_CTRL_INTEN;
}

/********************************************************************
** 函数名称：WDOG_GetIntStatus
** 函数功能：获取当前看门狗中断状态
** 输入参数：无
** 输出参数：无
** 返回参数：当前看门狗复位状态
********************************************************************/
FlagStatus WDOG_GetIntStatus(void)
{
	return (FlagStatus)(WDOG->CTRL==WDOG_CTRL_INTEN);
}

/********************************************************************
** 函数名称：WDOG_ClrIntEnable
** 函数功能：清除看门狗中断使能
** 输入参数：无
** 输出参数：无
** 返回参数：无
********************************************************************/
void WDOG_ClrIntEnable(void)
{
	WDOG->INTCLR = WDOG_INTCLR;									/* 写入任何值都可以清除中断 */
}

/********************************************************************
** 函数名称：WDOG_GetRawIntStatus
** 函数功能：获取当前原始看门狗中断状态
** 输入参数：无
** 输出参数：无
** 返回参数：当前原始看门狗中断状态
********************************************************************/
FlagStatus WDOG_GetRawIntStatus(void)
{
	return (FlagStatus)(WDOG->RIS==WDOG_RAWINTSTAT);
}

/********************************************************************
** 函数名称：WDOG_GetMaskIntStatus
** 函数功能：获取当前隐蔽看门狗中断状态
** 输入参数：无
** 输出参数：无
** 返回参数：当前隐蔽看门狗中断状态
********************************************************************/
FlagStatus WDOG_GetMaskIntStatus(void)
{
	return (FlagStatus)(WDOG->MIS==WDOG_MASKINTSTAT);
}

/********************************************************************
** 函数名称：WDOG_LockWriteAccess
** 函数功能：禁止写入所有的寄存器
** 输入参数：无
** 输出参数：无
** 返回参数：无
********************************************************************/
void WDOG_LockWriteAccess(void)
{
	WDOG->LOCK = 0;
}

/********************************************************************
** 函数名称：WDOG_UnlockWriteAccess
** 函数功能：使能写入所有的寄存器
** 输入参数：无
** 输出参数：无
** 返回参数：无
********************************************************************/
void WDOG_UnlockWriteAccess(void)
{
	WDOG->LOCK = 0x1ACCE551;  
}

/********************************************************************
** 函数名称：WDOG_SetITModeEnable
** 函数功能：设置集成测试模式使能
** 输入参数：无
** 输出参数：无
** 返回参数：无
********************************************************************/
void WDOG_SetITModeEnable(void)
{
	WDOG->ITCR |= WDOG_ITCR_INTEGTESTEN;
}

/********************************************************************
** 函数名称：WDOG_ClrITModeEnable
** 函数功能：清除集成测试模式使能
** 输入参数：无
** 输出参数：无
** 返回参数：无
********************************************************************/
void WDOG_ClrITModeEnable(void)
{
	WDOG->ITCR &= ~WDOG_ITCR_INTEGTESTEN;
}

/********************************************************************
** 函数名称：WDOG_GetITModeStatus
** 函数功能：获取集成测试模式状态
** 输入参数：无
** 输出参数：无
** 返回参数：集成测试模式状态
********************************************************************/
FlagStatus WDOG_GetITModeStatus(void)
{
	return (FlagStatus)(WDOG->ITCR==WDOG_ITCR_INTEGTESTEN);
}

/********************************************************************
** 函数名称：WDOG_SetITOP
** 函数功能：设置集成测试输出复位或中断
** 输入参数：无
** 输出参数：无
** 返回参数：无
********************************************************************/
void WDOG_SetITOP(uint32_t itop)
{
	WDOG->ITOP = itop;
}

/********************************************************************
** 函数名称：WDOG_ClrITOP
** 函数功能：清除集成测试输出复位或中断
** 输入参数：无
** 输出参数：无
** 返回参数：无
********************************************************************/
void WDOG_ClrITOP(uint32_t itop)
{
	WDOG->ITOP &= ~itop; 
}

/********************************************************************
** 函数名称：WDOG_ClrITOP
** 函数功能：获取集成测试输出复位状态
** 输入参数：无
** 输出参数：无
** 返回参数：集成测试输出复位状态
********************************************************************/
FlagStatus WDOG_GetITOPResStatus(void)
{
	return (FlagStatus)(WDOG->ITOP==WDOG_ITOP_WDOGRES);
}

/********************************************************************
** 函数名称：WDOG_ClrITOP
** 函数功能：获取集成测试输出中断状态
** 输入参数：无
** 输出参数：无
** 返回参数：集成测试输出中断状态
********************************************************************/
FlagStatus WDOG_GetITOPIntStatus(void)
{
	return (FlagStatus)(WDOG->ITOP==WDOG_ITOP_WDOGINT);
}

