/*
 * ***************************************************************************************** 		
 * 文件名称：PANGO_M1_spi.c
 * 功能描述：SPI固件库函数
 ******************************************************************************************
 */

#include "PANGO_M1_spi.h"

/********************************************************************
** 函数名称：SPI_Init
** 函数功能：SPI寄存器初始化，配置主从模式、相位、极性、分频系数等
** 输入参数：SPI_InitTypeDef：SPI初始化端口参数结构体指针
** 输出参数：无
** 返回参数：无
********************************************************************/
void SPI_Init(SPI_InitTypeDef* SPI_InitStruct)
{
	uint32_t new_ctrl = 0;

	SPI->CTRL = 0;
	SPI->STATUS = 0;

	if(SPI_InitStruct->DIRECTION == ENABLE)						/* 设置输出大小端模式*/
	{
		new_ctrl |= SPI_CR_DIRECTION;
	}

	if(SPI_InitStruct->PHASE == ENABLE)							/*设置相位*/
	{
		new_ctrl |= SPI_CR_PHASE;
	}

	if(SPI_InitStruct->POLARITY == ENABLE)						/*设置极性*/
	{
		new_ctrl |= SPI_CR_POLARITY;
	}

	new_ctrl |= (SPI_InitStruct->CLKSEL << SPI_CR_CLKSEL_Pos);

	SPI->CTRL = new_ctrl;										/*设置分配时钟*/
}

/********************************************************************
** 函数名称：SPI_SetDirection
** 函数功能：配置SPI方向（大小端模式）
** 输入参数：无
** 输出参数：无
** 返回参数：无
********************************************************************/
void SPI_SetDirection(void)
{
	SPI->CTRL |= SPI_CR_DIRECTION;
}

/********************************************************************
** 函数名称：SPI_ClrDirection
** 函数功能：清除SPI方向配置
** 输入参数：无
** 输出参数：无
** 返回参数：无
********************************************************************/
void SPI_ClrDirection(void)
{
	SPI->CTRL &= ~SPI_CR_DIRECTION;
}

/********************************************************************
** 函数名称：SPI_GetDirection
** 函数功能：读取SPI方向配置
** 输入参数：无
** 输出参数：无
** 返回参数：SPI当前方向值
********************************************************************/
uint32_t SPI_GetDirection(void)
{
	return ((SPI->CTRL&SPI_CR_DIRECTION)==SPI_CR_DIRECTION);
}

/********************************************************************
** 函数名称：SPI_SetPhase
** 函数功能：设置SPI相位
** 输入参数：无
** 输出参数：无
** 返回参数：无
********************************************************************/
void SPI_SetPhase(void)
{
	SPI->CTRL |= SPI_CR_PHASE;
}

/********************************************************************
** 函数名称：SPI_ClrPhase
** 函数功能：清除SPI相位
** 输入参数：无
** 输出参数：无
** 返回参数：无
********************************************************************/
void SPI_ClrPhase(void)
{
	SPI->CTRL &= ~SPI_CR_PHASE;
}

/********************************************************************
** 函数名称：SPI_GetPhase
** 函数功能：获取SPI相位
** 输入参数：无
** 输出参数：无
** 返回参数：SPI相位值
********************************************************************/
uint32_t SPI_GetPhase(void)
{
	return ((SPI->CTRL&SPI_CR_PHASE)==SPI_CR_PHASE);
}

/********************************************************************
** 函数名称：SPI_SetPolarity
** 函数功能：设置SPI极性
** 输入参数：无
** 输出参数：无
** 返回参数：无
********************************************************************/
void SPI_SetPolarity(void)
{
	SPI->CTRL |= SPI_CR_POLARITY;
}

/********************************************************************
** 函数名称：SPI_ClrPolarity
** 函数功能：清除SPI极性
** 输入参数：无
** 输出参数：无
** 返回参数：无
********************************************************************/
void SPI_ClrPolarity(void)
{
	SPI->CTRL &= ~SPI_CR_POLARITY;
}

/********************************************************************
** 函数名称：SPI_GetPolarity
** 函数功能：读取SPI极性
** 输入参数：无
** 输出参数：无
** 返回参数：SPI极性值
********************************************************************/
uint32_t SPI_GetPolarity(void)
{
	return ((SPI->CTRL&SPI_CR_POLARITY)==SPI_CR_POLARITY);
}

/********************************************************************
** 函数名称：SPI_SetClkSel
** 函数功能：设置SPI分频时钟系数
** 输入参数：无
** 输出参数：无
** 返回参数：无
********************************************************************/
void SPI_SetClkSel(uint32_t clksel)
{
	SPI->CTRL &= ~SPI_CR_CLKSEL;
	SPI->CTRL |= ((clksel&SPI_CR_CLKSEL_Mask)<<SPI_CR_CLKSEL_Pos);
}

/********************************************************************
** 函数名称：SPI_GetClkSel
** 函数功能：读取SPI分频时钟系数
** 输入参数：无
** 输出参数：无
** 返回参数：SPI分频系数
********************************************************************/
uint32_t SPI_GetClkSel(void)
{
	return ((SPI->CTRL >>SPI_CR_CLKSEL_Pos)&SPI_CR_CLKSEL_Mask);
}

/********************************************************************
** 函数名称：SPI_GetToeStatus
** 函数功能：读取SPI发送溢出错误状态
** 输入参数：无
** 输出参数：无
** 返回参数：SPI状态寄存器值
********************************************************************/
FlagStatus SPI_GetToeStatus(void)
{
	return (FlagStatus)((SPI->STATUS&SPI_STATUS_TOE)==SPI_STATUS_TOE);
}

/********************************************************************
** 函数名称：SPI_GetRoeStatus
** 函数功能：读取SPI接收溢出错误状态
** 输入参数：无
** 输出参数：无
** 返回参数：SPI状态寄存器值
********************************************************************/
FlagStatus SPI_GetRoeStatus(void)
{
	return (FlagStatus)((SPI->STATUS&SPI_STATUS_ROE)==SPI_STATUS_ROE);
}

/********************************************************************
** 函数名称：SPI_GetTmtStatus
** 函数功能：读取SPI正在发送状态
** 输入参数：无
** 输出参数：无
** 返回参数：SPI状态寄存器值
********************************************************************/
FlagStatus SPI_GetTmtStatus(void)
{
	return (FlagStatus)((SPI->STATUS&SPI_STATUS_TMT)==SPI_STATUS_TMT);
}

/********************************************************************
** 函数名称：SPI_GetTrdyStatus
** 函数功能：读取SPI发送准备就绪状态
** 输入参数：无
** 输出参数：无
** 返回参数：SPI状态寄存器值
********************************************************************/
FlagStatus SPI_GetTrdyStatus(void)
{
	return (FlagStatus)((SPI->STATUS&SPI_STATUS_TRDY)==SPI_STATUS_TRDY);
}

/********************************************************************
** 函数名称：SPI_GetRrdyStatus
** 函数功能：读取SPI读取准备就绪状态
** 输入参数：无
** 输出参数：无
** 返回参数：SPI状态寄存器值
********************************************************************/
FlagStatus SPI_GetRrdyStatus(void)
{
	return (FlagStatus)((SPI->STATUS&SPI_STATUS_RRDY)==SPI_STATUS_RRDY);
}

/********************************************************************
** 函数名称：SPI_GetRcvStatus
** 函数功能：读取状态寄存器，判断是否可以进行下一步读数据操作
** 输入参数：无
** 输出参数：无
** 返回参数：SPI状态寄存器值
********************************************************************/
FlagStatus SPI_GetRcvStatus(void)
{
	return (FlagStatus)((SPI->STATUS&SPI_STATUS_RCV)==SPI_STATUS_RCV);
}

/********************************************************************
** 函数名称：SPI_SetRcvStatus
** 函数功能：写状态寄存器，表示下一个操作即将开始读取SPI数据
** 输入参数：无
** 输出参数：无
** 返回参数：无
********************************************************************/
void SPI_SetRcvStatus(void)
{
	SPI->STATUS |= SPI_STATUS_RRDY;
}

/********************************************************************
** 函数名称：SPI_ClrToeStatus
** 函数功能：写状态寄存器，清除传输溢出错误状态
** 输入参数：无
** 输出参数：无
** 返回参数：无
********************************************************************/
void SPI_ClrToeStatus(void)
{
	SPI->STATUS |= SPI_STATUS_TOE;
}

/********************************************************************
** 函数名称：SPI_ClrRoeStatus
** 函数功能：写状态寄存器，清除接收溢出错误状态
** 输入参数：无
** 输出参数：无
** 返回参数：无
********************************************************************/
void SPI_ClrRoeStatus(void)
{
	SPI->STATUS |= SPI_STATUS_ROE;
}

/********************************************************************
** 函数名称：SPI_WriteData
** 函数功能：写入1个字节数据
** 输入参数：无
** 输出参数：无
** 返回参数：无
********************************************************************/
void SPI_WriteData(uint8_t data)
{
	SPI->WDATA = data;
}

/********************************************************************
** 函数名称：SPI_ReadData
** 函数功能：读取1个字节数据
** 输入参数：无
** 输出参数：无
** 返回参数：无
********************************************************************/
uint8_t SPI_ReadData(void)
{
	return (uint8_t)(SPI->RDATA); 
}

/********************************************************************
** 函数名称：SPI_Select_Slave
** 函数功能：选择从设备（未使用）
** 输入参数：Slave_address：从设备地址
** 输出参数：无
** 返回参数：无
********************************************************************/
void SPI_Select_Slave(uint32_t Slave_address)
{
	SPI->SSMASK = Slave_address;
}

/********************************************************************
** 函数名称：SPI_CS_Enable
** 函数功能：SPI从设备片选使能控制
** 输入参数：cs：从设备片选编号
** 输出参数：无
** 返回参数：无
********************************************************************/
void SPI_CS_Enable(uint32_t cs)
{
	SPI->CTRL |= cs;
}

/********************************************************************
** 函数名称：SPI_CS_Disable
** 函数功能：SPI从设备片选禁止控制
** 输入参数：cs：从设备片选编号
** 输出参数：无
** 返回参数：无
********************************************************************/
void SPI_CS_Disable(void)
{
	SPI->CTRL &= ~SPI_CR_CS;
}
