/*
 * *****************************************************************************************		
 * 文件名称：PANGO_M1_memory.c
 * 功能描述：MEMORY固件库函数
 ******************************************************************************************
 */

#include "PANGO_M1_memory.h"

/********************************************************************
** 函数名称：Memory_Write_Bytes
** 函数功能：向memory里面写入一个32bit数据
** 输入参数：address：写数据地址
**           data：写入的32bit数据
** 输出参数：无
** 返回参数：无
********************************************************************/
void Memory_Write_Bytes(uint32_t address, uint32_t data)
{
	(*(__IO uint32_t*)(address)) = data;
}

/********************************************************************
** 函数名称：Memory_Read_Bytes
** 函数功能：读取memory里面一个32bit数据
** 输入参数：address：读数据地址
** 输出参数：无
** 返回参数：读出的32bit数据数据
********************************************************************/
uint32_t Memory_Read_Bytes(uint32_t address)
{
	return (*(__IO uint32_t*)(address));
}

