#Generated by Fabric Compiler ( version 2020.3-SP3.1 <build 67625> ) at Sun Mar 14 08:40:24 2021

set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
